## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-n8n/actions/runs/15761449167).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.ecs_task_ssm_parameters will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # data.aws_iam_policy_document.efs_access_point_secure will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "efs_access_point_secure" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientWrite",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowAccessThroughAccessPoint"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "elasticfilesystem:AccessPointArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "DenyNonSecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.efs_mount will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "efs_mount" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientWrite",
              + "elasticfilesystem:DescribeMountTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_acm_certificate.n8n will be created
  + resource "aws_acm_certificate" "n8n" {
      + arn                       = (known after apply)
      + domain_name               = "n8n.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.n8n.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "n8n.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.n8n.cdssandbox.xyz",
          + "n8n.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.n8n will be created
  + resource "aws_acm_certificate_validation" "n8n" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_efs_access_point.n8n will be created
  + resource "aws_efs_access_point" "n8n" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags            = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/n8n"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "775"
            }
        }
    }

  # aws_efs_backup_policy.n8n will be created
  + resource "aws_efs_backup_policy" "n8n" {
      + file_system_id = (known after apply)
      + id             = (known after apply)

      + backup_policy {
          + status = "ENABLED"
        }
    }

  # aws_efs_file_system.n8n will be created
  + resource "aws_efs_file_system" "n8n" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + throughput_mode         = "bursting"

      + protection (known after apply)
    }

  # aws_efs_file_system_policy.n8n will be created
  + resource "aws_efs_file_system_policy" "n8n" {
      + bypass_policy_lockout_safety_check = false
      + file_system_id                     = (known after apply)
      + id                                 = (known after apply)
      + policy                             = (known after apply)
    }

  # aws_efs_mount_target.n8n[0] will be created
  + resource "aws_efs_mount_target" "n8n" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_efs_mount_target.n8n[1] will be created
  + resource "aws_efs_mount_target" "n8n" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_iam_role.n8n_waf_logs will be created
  + resource "aws_iam_role" "n8n_waf_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "n8n-waf-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.n8n_waf_logs will be created
  + resource "aws_iam_role_policy" "n8n_waf_logs" {
      + id          = (known after apply)
      + name        = "n8n-waf-logs"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cbs-satellite-517451398792/*",
                          + "arn:aws:s3:::cbs-satellite-517451398792",
                        ]
                    },
                  + {
                      + Action   = "iam:CreateServiceLinkedRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::*:role/aws-service-role/wafv2.amazonaws.com/AWSServiceRoleForWAFV2Logging"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_kinesis_firehose_delivery_stream.n8n_waf_logs will be created
  + resource "aws_kinesis_firehose_delivery_stream" "n8n_waf_logs" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-n8n"
      + tags_all       = (known after apply)
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-517451398792"
          + buffering_interval = 300
          + buffering_size     = 5
          + compression_format = "GZIP"
          + custom_time_zone   = "UTC"
          + prefix             = "waf_acl_logs/AWSLogs/517451398792/"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options (known after apply)
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_lb.n8n will be created
  + resource "aws_lb" "n8n" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "n8n-staging"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                                                     = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "cbs-satellite-517451398792"
          + enabled = true
          + prefix  = "lb_logs"
        }

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.n8n will be created
  + resource "aws_lb_listener" "n8n" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-3-FIPS-2023-04"
      + tags                                                                  = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                                                              = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group.n8n will be created
  + resource "aws_lb_target_group" "n8n" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 5678
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = true
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_route53_record.n8n_A will be created
  + resource "aws_route53_record" "n8n_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "n8n.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z0528512WTOPE2TB0F58"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.n8n_validation["*.n8n.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "n8n_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0528512WTOPE2TB0F58"
    }

  # aws_route53_record.n8n_validation["n8n.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "n8n_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0528512WTOPE2TB0F58"
    }

  # aws_security_group.n8n_ecs will be created
  + resource "aws_security_group" "n8n_ecs" {
      + arn                    = (known after apply)
      + description            = "NSG for n8n ECS Tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "n8n_ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.n8n_efs will be created
  + resource "aws_security_group" "n8n_efs" {
      + arn                    = (known after apply)
      + description            = "Allow access to EFS from n8n ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "n8n_efs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.n8n_lb will be created
  + resource "aws_security_group" "n8n_lb" {
      + arn                    = (known after apply)
      + description            = "NSG for n8n load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "n8n_lb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.n8n_ecs_egress_all will be created
  + resource "aws_security_group_rule" "n8n_ecs_egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.n8n_ecs_ingress_lb will be created
  + resource "aws_security_group_rule" "n8n_ecs_ingress_lb" {
      + description              = "Ingress from load balancer to n8n ECS task"
      + from_port                = 5678
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5678
      + type                     = "ingress"
    }

  # aws_security_group_rule.n8n_efs_ingress_ecs will be created
  + resource "aws_security_group_rule" "n8n_efs_ingress_ecs" {
      + description              = "Allow NFS traffic from n8n ECS tasks"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "ingress"
    }

  # aws_security_group_rule.n8n_lb_egress_ecs will be created
  + resource "aws_security_group_rule" "n8n_lb_egress_ecs" {
      + description              = "Egress from load balancer to n8n ECS task"
      + from_port                = 5678
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5678
      + type                     = "egress"
    }

  # aws_security_group_rule.n8n_lb_ingress_internet_https will be created
  + resource "aws_security_group_rule" "n8n_lb_ingress_internet_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Ingress from internet to load balancer (HTTPS)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_shield_application_layer_automatic_response.n8n_alb will be created
  + resource "aws_shield_application_layer_automatic_response" "n8n_alb" {
      + action       = "BLOCK"
      + id           = (known after apply)
      + resource_arn = (known after apply)
    }

  # aws_shield_protection.n8n_alb will be created
  + resource "aws_shield_protection" "n8n_alb" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "n8n-alb"
      + resource_arn = (known after apply)
      + tags         = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_shield_protection.n8n_route53 will be created
  + resource "aws_shield_protection" "n8n_route53" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "n8n-route53"
      + resource_arn = "arn:aws:route53:::hostedzone/Z0528512WTOPE2TB0F58"
      + tags         = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_shield_subscription.n8n will be created
  + resource "aws_shield_subscription" "n8n" {
      + auto_renew = "ENABLED"
      + id         = (known after apply)
    }

  # aws_ssm_parameter.n8n_encryption_key will be created
  + resource...
```

</details>

